<template>
  <div class="welcome">
    <banner title="欢迎你，章北海" subTitle="你已经累计申请导入 10 次"></banner>
    <div class="readme">
      Apple Music与隐私 Apple Music旨在保护您的信息并可让您选择要共享的内容。
      Apple收集您Apple
      Music活动的相关信息，如播放的歌曲及其播放时长，以在您订阅时个性化相关服务、向您发送通知以及向合作伙伴支付版税。
      iCloud音乐资料库会将音乐资料库中的信息（如歌曲和艺人名字）发送给Apple，以确定和解锁Apple
      Music中也有提供的任何歌曲的副本。
      在您订阅期间以及结束订阅后的一小段时间内，我们会将您的iCloud音乐资料库信息与您关联。我们保留歌曲播放记录，保留期限符合财务报告相关适用法律的规定。
      为了帮助辨识和防止欺诈行为，当您尝试购买时，与您的设备使用方式相关的信息（包括大致的通话次数或收发的电子邮件数量）将用于计算并得出一个设备信任值。数值经处理后提交，Apple无法获悉您设备上的真实数值。该数值会在我们的服务器上储存一段固定的时间。
      保护您信息的隐私和安全是Apple每个人的首要任务。我们尽力仅收集为您带来更佳体验所需的数据。收集数据时，我们始终认为您对所收集数据及为何需要这些数据有知情权，以便您做出明智选择，这十分重要。与每一种Apple产品和服务一样，Apple
      Music在设计上同样基于上述原则。 我们使用您的个人信息在Apple
      Music中提供相关服务和功能。此类信息包括您的帐户和支付信息，您可以在“设置”中访问和更改。
      当您订阅时，Apple收集您如何使用Apple
      Music的相关信息，以根据您的音乐品味量身定制各项功能。这些功能包括“现在收听”（可以看到为您挑选的专辑与播放列表）和“广播”（根据您喜欢的艺人与风格播放精选内容）。我们还使用这些信息通过电子邮件来联系您，并向您推送Apple
      Music上您可能喜爱的近期发布内容、新艺人和其他动向相关的通知。
      如要和其他使用Apple
      Music的用户互动或共享，您可以提供用户名称（例如：@johnappleseed）和显示名称来创建个人资料，如有需要，还可提供个人头像及其他信息。Apple将这些信息储存在您的帐户下，以便您在您任何设备上均可访问。您的用户名称、显示名称和个人头像可能在您于Apple
      Music上发布的任何内容及共享的活动旁出现。目前，共享和发布内容不适用于、也不提供给儿童Apple
      ID。 其他用户也可能使用您提供的信息，查找到您Apple Music的个人资料。
      您可以将您个人资料的内容，如听歌历史记录和播放列表等，仅对所选用户可见。但您的个人资料信息，如名称、显示名称、照片、粉丝和关注，将始终对所有人可见。
      当您在Apple
      Music上创建个人资料时，我们会推荐您可能想要加为好友进行关联互动的其他Apple
      Music订阅用户。检索可推荐的好友时，Apple不会获悉或储存您的联系人信息。仅您联系人的电话号码和电子邮件地址会转换为缩短且加密的哈希值并发送给Apple，随后会在您的设备上本地检索匹配的Apple
      Music订阅用户以作推荐。Apple
      Music可以定期检查您的联系人以持续为您推荐新的好友；您可以在“帐户设置”中停用“订阅Apple
      Music的联系人”来控制此功能。如果您不想让他人通过其通讯录中您的Apple
      ID联系信息找到您，您可以在“帐户设置”中停用“允许通过Apple
      ID找到我”进行更改。 您还可以关联Facebook等社交网络帐号以在Apple
      Music上找到更多可关联互动的用户，并让他们也能找到您。如果这样做，Apple
      Music会将您的Apple
      Music帐户和社交网络账号关联，并找到该社交网络中同样订阅Apple
      Music的好友。我们不会保留非Apple
      Music订阅用户的好友的信息。如果稍后您希望从Apple
      Music帐户取消关联这些社交网络，您可以在这些已关联社交网络的设置中操作。
      您随时可以更新或移除您在个人资料中提供的信息。在线共享时，您应对自己公开发布的内容慎重考虑。当您从Apple
      Music共享内容至其他网站或社交网络时，您共享的任何内容均受相关服务商的隐私政策约束。
      如果您的移动网络提供商提供Apple
      Music会员资格，Apple可能会检查您的电话号码以确定您是否通过移动网络提供商合作伙伴加入会员。如果您通过移动网络提供商注册，您的电话号码将用于识别您的帐户以及告知移动网络提供商您已激活会员资格。我们使用您的会员资格关联的电话号码在您登录时验证您的帐户，并将您的Apple
      Music活动与您的帐户关联。我们还使用您的电话号码以在您请求时通过移动网络提供商请求取消您的会员资格。
      iCloud音乐资料库是拥有Apple
      Music会员资格的一项优势，它允许您从您的任何设备访问资料库中的歌曲和播放列表。此功能会从您的音乐资料库发送歌曲及艺人姓名等信息给Apple，以识别并解锁Apple
      Music中可找到的您拥有歌曲的副本。Apple
      Music中找不到的歌曲将上传到您的个人iCloud音乐资料库，以便您在任何设备上均可访问您的完整收藏。若要停止同步iCloud音乐资料库，请前往“设置”并关闭“同步资料库”。
      当您使用Apple
      Music会员资格时，我们会收集以下相关信息：您播放或添加到音乐资料库或播放列表中的歌曲和视频，以及您喜爱、评论或分享的内容。您的帐户、IP地址、用于播放的设备、App或车机、您播放时在Apple
      Music中所处的位置、播放时间及时长等信息，会被记录并发送给Apple。我们用这些信息来定制您的Apple
      Music体验，向您发送电子邮件和通知，并帮助我们了解用户使用Apple
      Music的情况，以便我们对其加以改进。例如，这些信息可帮助我们挑选在“现在收听”和“广播”中向您展示的音乐、视频和艺人内容。通过这些信息，我们还可以为您进行其他符合您品味的推荐、支付版税并防止违反或可能违反Apple媒体服务条款和条件或适用法律的活动，或对其采取措施。
      Apple可能使用您帐户的相关信息，例如您拥有的Apple产品和您订阅的Apple服务，以向您发送与Apple音乐和Apple其他产品、服务相关的信息，并提供您可能感兴趣的内容，包括Apple
      One。如果购买了Apple
      One订阅，我们可能向您发送与所订阅每项服务功能相关的电子邮件并推送相关通知。Apple还可能使用与您在Apple音乐中活动相关的信息，向您发送与Apple音乐中新功能、内容和活动相关的电子邮件并推送相关通知。您可以通过访问appleid.apple.com
      来更改您的电子邮件偏好设置并选择不接收这些电子邮件。若要在iOS和iPadOS上更新通知偏好设置，请前往“设置”>“通知”>“音乐”。
      部分Apple
      Music功能（如某些广播电台）可能在您所处的地区不可用。Apple可能会使用您互联网连接的IP地址来估计您的位置并确定哪些功能可用。
      当您尝试购买时，我们还会使用与您的设备使用方式相关的信息（包括大致的通话次数或收发的电子邮件数量）在设备上计算并得出一个设备信任值。数值经处理后提交，Apple无法获悉您设备上的底层数值。该数值会在我们的服务器上储存一段固定的时间。
      我们可能会出于任何目的收集、使用、转让或披露非个人信息。例如，我们可能将您与其他Apple
      Music用户的非个人信息聚合以便改进服务。
      Apple收集的信息始终会遵照Apple的“隐私政策”处理，其内容可参阅www.apple.com/cn/privacy
      向第三方披露 使用Apple
      Music收听广播时，您的设备会直接接入广播电台来为您提供所需的内容。连接时，设备的IP地址对广播电台可见。广播电台对您IP地址的操作受广播电台或其提供商的隐私政策制约。
      我们有义务将您使用Apple Music（包括Apple
      Music提供的广播内容）的一些非个人信息提供给与这些服务关联的战略合作伙伴，例如，唱片公司，以助其衡量创作表现、满足版税和会计要求并改进其产品和服务。我们还会将聚合形式的非个人的听歌活动和用户人口统计数据，如年龄和性别，提供给艺人，以使他们更了解自己的听众。此外，我们可能会将您的部分个人信息，如电话运营商，提供给Apple的合作伙伴，以提供产品和服务或帮助Apple进行客户营销。
      iOS和iPadOS App可能会请求访问Apple
      Music和您的媒体资料库。如果您给予一款App相应的许可，它即可访问设备上的媒体资料库、您是否是Apple
      Music订阅用户、您的音乐和视频播放活动和您的“现在收听”等信息。受许可的App还可以更改与您帐户关联的数据，如哪些歌会在您的资料库和播放列表中。您可以在iOS或iPadOS设备上前往“设置”>“隐私”>“媒体与Apple
      Music”来停用App的访问权限，如果您已经使用iOS
      11或iPadOS之前的iOS版本移除该App或授权App的访问权限，您可以在Apple
      Music帐户设置中停用其访问权限。 进一步了解Apple Music
      如需了解功能和价格等更多详细信息，请参阅www.apple.com/cn/apple-music。
      有关Apple
      Music网页播放器与隐私的信息，请参阅https://support.apple.com/HT208364。
      发布日期： 2020 年 12 月 13 日
    </div>
    <div class="action">
      <div>
        <el-button @click="back">取消申请</el-button>
        <el-button type="primary" @click="next">我知道了</el-button>
      </div>
    </div>
  </div>
</template>

<script>
import Banner from '../components/Banner';
export default {
  components: {
    Banner,
  },
  methods: {
    back() {
      this.$router.push({ name: 'account' });
    },
    next() {
      this.$router.push('medium');
    },
  },
};
</script>

<style lang="scss" scoped>
.welcome {
  display: flex;
  justify-content: center;
  width: 100%;
  height: 100%;
  .readme {
    position: absolute;
    top: 120px;
    bottom: 100px;
    width: 560px;
    overflow-x: hidden;
    overflow-y: auto;
    margin: 10px;
  }
  .action {
    position: absolute;
    bottom: 0;
    width: 100%;
    height: 100px;
    display: flex;
    justify-content: center;
    align-items: center;
    border-top: 1px solid #f1f1f1;
  }
}
</style>
